# MoviETL by Mayssa and Hamza

## SQL Alchemy

In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
password = 'asdSA123!'
connection = f'root:{password}@127.0.0.1:3306/movie_db'
engine = create_engine(f'mysql://{connection}')

In [3]:
engine.table_names()

[]

In [4]:
movie = pd.read_csv('Resources/movie_new.csv', delimiter = ',', encoding = 'latin-1')
actor = pd.read_csv('Resources/cast_new.csv', delimiter = ',', encoding = 'latin-1')
genre = pd.read_csv('Resources/genre_new.csv', delimiter = ',', encoding = 'latin-1')
finance = pd.read_csv('Resources/finance_new.csv', delimiter = ',', encoding = 'latin-1')
ratings = pd.read_csv('Resources/ratings_new.csv', delimiter = ',', encoding = 'latin-1')
production = pd.read_csv('Resources/production_new.csv', delimiter = ',', encoding = 'latin-1')

In [5]:
movie.to_sql(name = 'movie', con = engine, if_exists = 'append', index = False)
actor.to_sql(name = 'actor', con = engine, if_exists = 'append', index = False)
genre.to_sql(name = 'genre', con = engine, if_exists = 'append', index = False)
finance.to_sql(name = 'finance', con = engine, if_exists = 'append', index = False)
ratings.to_sql(name = 'ratings', con = engine, if_exists = 'append', index = False)
production.to_sql(name = 'production', con = engine, if_exists = 'append', index = False)

In [6]:
engine.table_names()

['actor', 'finance', 'genre', 'movie', 'production', 'ratings']

In [7]:
pd.read_sql_query('SELECT * \
FROM movie \
LIMIT 10', con = engine)

,id,title,release_date,overview,runtime,language,imdb_link
0,862,Toy Story,1995-10-30,"Led by Woody, Andy's toys live happily in his ...",81.0,en,https://www.imdb.com/title/tt0114709
1,8844,Jumanji,1995-12-15,When siblings Judy and Peter discover an encha...,104.0,en,https://www.imdb.com/title/tt0113497
2,15602,Grumpier Old Men,1995-12-22,A family wedding reignites the ancient feud be...,101.0,en,https://www.imdb.com/title/tt0113228
3,31357,Waiting to Exhale,1995-12-22,"Cheated on, mistreated and stepped on, the wom...",127.0,en,https://www.imdb.com/title/tt0114885
4,11862,Father of the Bride Part II,1995-02-10,Just when George Banks has recovered from his ...,106.0,en,https://www.imdb.com/title/tt0113041
5,949,Heat,1995-12-15,"Obsessive master thief, Neil McCauley leads a ...",170.0,en,https://www.imdb.com/title/tt0113277
6,11860,Sabrina,1995-12-15,An ugly duckling having undergone a remarkable...,127.0,en,https://www.imdb.com/title/tt0114319
7,45325,Tom and Huck,1995-12-22,"A mischievous young boy, Tom Sawyer, witnesses...",97.0,en,https://www.imdb.com/title/tt0112302
8,9091,Sudden Death,1995-12-22,International action superstar Jean Claude Van...,106.0,en,https://www.imdb.com/title/tt0114576
9,710,GoldenEye,1995-11-16,James Bond must unmask the mysterious head of ...,130.0,en,https://www.imdb.com/title/tt0113189

In [8]:
pd.read_sql_query("SELECT a.name AS actor_name \
FROM movie m \
INNER JOIN actor a ON a.movie_id = m.id \
WHERE m.title = 'Jumanji'", con = engine).head()

            actor_name
0        Russell Crowe
1            Ed Harris
2    Jennifer Connelly
3  Christopher Plummer
4         Paul Bettany

In [9]:
pd.read_sql_query("SELECT g.name as genre FROM movie m INNER JOIN genre g ON g.movie_id = m.id \
WHERE m.title = 'A Beautiful Mind'", con = engine)

     genre
0    Drama
1  Romance

In [10]:
pd.read_sql_query("SELECT m.title, m.release_date, f.budget, f.revenue, r.rating FROM movie m \
INNER JOIN finance f ON f.movie_id = m.id \
INNER JOIN ratings r ON r.movie_id = m.id \
WHERE title = 'A Beautiful Mind'", con = engine)

              title release_date    budget      revenue    rating
0  A Beautiful Mind   2001-12-11  60000000  313542341.0  3.106415

In [11]:
pd.read_sql_query("SELECT p.name AS production_company from movie m \
INNER JOIN production p ON p.movie_id = m.id \
WHERE title = 'A Beautiful Mind'", con = engine)

      production_company
0  Imagine Entertainment
1         DreamWorks SKG
2     Universal Pictures